/**
 
 2.符号导航器：显示代码中的类、对象、函数等元素信息。
 1:hierarhical 分层  Flat 平级
 2:符号导航器中所显示出来额符号前面都有一个特殊的图标，用于表示符号元素的种类
 C 类（Class） / f    结构体（Struct) / Pr    协议（Protocol） /S    联合体（Union）/ U    函数（Function）/ K    类型定义（Typedef）
 E    全局变量（Global Variable） / M    方法（Method） /T    枚举（Enum）/ P    属性（Property）  /V    枚举成员（Case）
 3:过滤选择
 第一个过滤按钮（正方形括起来的C）永远选择是指显示类和方法，还是显示全部类型的符号（比如协议、结构、枚举等）。如果选择显示全部类型的符号的话，符号导航栏将会按照类型类进行分组
 第二个过滤按钮（折起来的文件夹）则是泳衣选择是否只显示本地项目中所定义的符号。取消选中之后，符号导航栏将会检索所有当前项目所导入的其他项目、框架中定义中的符号。然后将会显示有多少是来自于本地项目，有多少是来自于系统。
 第三个过滤按钮（正方形括起来的M）用来指定给定符号的成员（比如类的成员）是否显示
 
 */
