IDE 的界面分布

A:顶部菜单区
    1.Xcode(辅助工具 / 偏好设置)
    2.File（playground、workspace、project、target、file、group的管理）
    3.Edit(在文件编辑中的操作)
    4.View (编辑器界面显示的控制)
        标准单窗口编辑器、辅助编辑器、版本控制显示器、导航模块的切换、调式区域显示
    5.Find(查找，搜索)
    6.Navigate(跳转引导)
    7.Editor(文件显示设置)
    8.Prouct(产品系列功能)
        运行、测试、分析、归档、编译、清除、停止、配置、运行平台、持续集成
    9.Debug(调试操作)
    10.Source Conttol(版本控制)
    11.Window（链接的设备、模拟器、Archives、Crashes记录、IDE文档、）
    12.Help(IDE信息 特性 帮助)


B:导航器区()
    01项目导航器（本项目所以资源文件）
    02符号导航器（显示代码中的类、对象、函数等元素信息。）
    03搜索导航器（用来显示搜索结果和选择搜索方式。）
    04事件导航器（显示在工具区找到的任何事件。比如编译错误、语法错误、库链接异常，以及错误提示等）
    05测试导航器（显示单元测试用例以及测试结果，还可以快速执行单元测试。）
    06调试导航器（显示应用程序在调试状态下资源占用状态以及堆栈信息。）
    07断点导航器（显示应用程序中标记的所有断点信息。）
    08日志导航器（显示所有日志信息，包括编译、分析、测试、调试的日志信息）
C:资源文件展示编辑区

D:检查器控制区


E:调式控制区


