//
//  组成元素.c
//  CStudy
//
//  Created by xs on 2018/8/20.
//  Copyright © 2018年 Touker. All rights reserved.
//

#include <stdio.h>
/*
 注释
1.单行注释 //…
 注释只能显示在一行内，通常出现在一条语句的右边或者上方，对于注释符”//”，一个注释里只要有多余2个’/’都可以。
2.多行注释
 多行注释不能嵌套使用

 关键字
 1.这些保留字不能作为常量名、变量名或其他标识符名称，由语言定义有特殊含义

 标识符
 1.标识符是用来标识变量、函数，或任何其他用户自定义项目的名称
 2.一个标识符只能由 字母、数字、下划线组成


分号 ;
 1.在 C 程序中，分号是语句结束符。也就是说，每个语句必须以分号结束。它表明一个逻辑实体的结束。
空格
 1.语句 中的 空格，让编译器能识别语句中的某个元素（比如 int）在哪里结束，下一个元素在哪里开始
 2.只包含空格的行，被称为空白行，可能带有注释，C 编译器会完全忽略它。

 语句
 表达式
 函数
 预处理器指令



常量
 1.含义:常量是固定值，在程序执行期间不会改变
 2.类型:常量可以是任何的基本数据类型，比如整数常量、浮点常量、字符常量，或字符串字面值，也有枚举常量
 3.属性:在定义后不能进行修改。
变量




 */
