//
//  ff.h
//  1212
//
//  Created by xs on 2020/12/21.
//

#import <Foundation/Foundation.h>


/*
 甲子:一甲子即60年
 时:即时辰，等于现代的两小时。古代一昼夜分为12时辰
 更:古人将一夜分为五更，从晚上7点开始起更，一更约两小时，三更就是11时至1时
 现时每昼夜为二十四小时，在古时则为十二个时辰
 子（鼠）时是二十三点到一点，以零点为正点；
 丑（牛）时是一点到三点，以两点为正点；
 寅（虎）时是三点到五点，以四点为正点；
 卯（兔）时是五点到七点，以六点为正点；
 辰（龙）时是七点到九点，以八点为正点；
 巳（蛇）时是九点到十一点，以十点为正点；
 午（马）时是十一点到十三点，以十二点为正点；
 未（羊）时是十三点到十五点，以十四点为正点；
 申（猴）时是十五点到十七点，以十六点为正点；
 酉（鸡）时是十七点到十九点，以十八点为正点；
 戌（狗）时是十九点到二十一点，以二十点为正点；
 亥（猪）时是二十一点到二十三点，以二十二点为正点。

 */
@interface ff : NSObject
@end


