计算机发展历史，编程语言发展历史，二者关系

计算机组成—计算机体系结构— 微机原理：这一阶段你可以按照下面这个教程写一个x86的模拟器。

操作系统：你现在已经可以写一个操作系统内核了，推荐使用qemu这款轻量级的模拟器（基本的BIOS, x86指令集,MBR都是有实现的）


计算机网络：这一关过完，你差不多可以写一个幻影wifi--pin   的无界面版。
这期间你需要学习一下python+爬虫，[+html+js+css](后面三个可选)


程序 + 编译原理

客户端开发（后台，web,移动，桌面）

数据结构 + 数据库 +图形学


修真院推荐洗髓换骨营六门课，就是帮助非科班生华丽转身，洗髓换骨打根基的。
计算机组成原理，讲述硬件构成，基本结构，数据展示。
计算机操作系统，讲述软件如何控制硬件，操作系统的基本原理。
计算机网络讲述多台机器如何构建成网络，互相通信。
这三门课从硬到软到勾搭成网，描述了互联网构成的核心元素。
但如果你要写代码，还要继续学习一下三门课。
数据结构告诉你外在的世界投影到计算机里的基本模型是什么。 数据库告诉你怎么将数据永久存储，管理，读写的法决是什么。 算法告诉你解决问题的步骤，思路是什么。

这三门课是完整解释了怎么使用计算机这种法器。用修真的语言来对应描述的话，前三门课讲的是法器的原理，后三门课讲的是控制法器的法决。

特别提醒，对于初学者来说，很容易犯的错误和问题就是只学习，不知道有什么用。 所以6门课学完以后，内容太多，记不住，在工作中找不到对应的场景。
所以修真院在腾讯课堂设置的洗髓换骨营，就是反过来，先整理在工作中用到的知识点，再去对应的课程里画重点。
计算机组成原理中很关键的知识就是编码，utf8，gbk这些到底是什么，知道这些才能解决乱码问题。 操作系统里要弄清楚线程进程协程，高并发，异步等场景需要它。 计算机网络中必须要懂tcp和ip，前后端联调和性能优化必备，特别是运维工程师。 数据结构里更要懂数组链表，各种语言的基本类型。 数据库里要学就学索引和范式，db设计和优化的必备知识点。 算法更重要的是演练思维模式，编程思维体现的最好方向。

