//
//  02CollectionType.c
//  2009C
//
//  Created by xs on 2019/1/21.
//  Copyright © 2019 Touker. All rights reserved.
//

#include "02CollectionType.h"
static void runFunc(){
    printf("aaa");
}


/**
 结构体

 */
static void test6(){
    // 1.定义类型 ，成员变量 以;号隔开


    //    定义类型的同时定义变量


    //    匿名结构体变量，不能重复复用


    // 2.初始化


    // 3.成员变量的 访问 修改


    // 4.结构体变量之间 若是相同类型则可以互相赋值，且只做值传递
}

/**数组
 1.数组的类型 由什么决定:
 2.元素个数规则
   a.必须是什么类型数据
   b.定义的时候什么情况下可不写
 */
static void test7(){

    //1.初始化
    // 未初始化的元素 是不确定的
    // 元素个数由初始化的元素确定
    // 元素全部初始化
    // 元素部分初始化，未初始化的元素值 不确定
    // 指定位置初始化
    //2.数组元素个数

    //3.取元素值

    //4.更变元素值


    //    1.整形数组


    //    2.浮点数组


    /**
     字符数组_字符串
     1.字符数组
     2.字符串:
       1.符合什么条件才算是字符串
        2.字符串数组的表示
     3."" 赋值给 字符数组的2情况，
     */

    // 0.字符数组

    // 0.字符串空字符的二种本质形式，字符以整数存储
    // 1.
    // 2.

    // 3."it" 赋值给 字符数组的2情况，
    // 从 "it" 角度看 "it"
     //从 数组变量角度看变量



    //    5.枚举数组


    //    6.结构体数组


    /**二维数组
     1.数据类型 组成
     2.第一个元素表示什么
     3.第二个元素表示什么
     */
    // 1.初始化

    // 2.赋值 取值

    /**
     指针数组
     1.表示
     2.符号结合规则
     */

}

