//
//  06Statement.c
//  2009C
//
//  Created by xs on 2019/1/22.
//  Copyright © 2019 Touker. All rights reserved.
//

#include "06Statement.h"
/**局部变量
 1.定义
 2.关键字
 3.生命周期
 4.被static修饰的局部变量
 */
/**全局变量
 1.定义
 2.键字
 3.生命周期
 4.被static修饰的全部变量
 */
/**变量声明:
 1.什么叫声明
 2.变量次数
 3.声明格式:
 a.局部变量
 b.全局变量
 */

/**变量定义
 1.什么叫定义：
 2.定义
 3.定义次数
 */


//全局变量
// 声明 全局变量
// 重复声明 全局变量

// 定义全局变量（附带声明属性
// 重复定义全局变量（与上为同一个变量）

//静态全局变量
// 定义（附带声明属性） 静态全局 变量

/**static 与 extern

 */


/**外部函数
 1.什么叫
 2.键字
 */
/**内部函数
 1.什么叫
 2.键字
 */
/**函数声明
 a.外部函数的声明:
 b.内部函数的声明:

 */
/**函数定义
 1.函数只能定义一次
 2.不同文件的外部函数
 3.不同文件的内部函数
 */


/** const https://www.cnblogs.com/icemoon1987/p/3320326.html
 1.const 修饰基本数据类型 整形 浮点 枚举 ，其变量值不可修改
 2.const 修饰结构体变量，其本身 与成员变量 都不可被修改
 3.const 修饰数组， 数组元素不可被修改
 4.const 修饰 *p ，则 *p的值不可被修改，指针变量p可修改
 5.const 修饰 p ，则 指针变量p不可修改，*p的值可被修改，
 6.const 修饰函数参数，表示对于函数来说，不会在意传入的参数外面是否是只读的，它只会在函数内部，将入参当作只读变量处理
 */

/** const和static的结合使用
 1.声明一个只读的 内部全局变量,一般需要在定义的时候初始化 不然无意义了
 */


/** const和extern的结合使用
 1.声明一个只读的全部变量（全局常量）
 */
 // 声明一个只读的全局变量
// 定义一个只读的全局变量，并初始化
