//
//  00image知识.m
//  2019OC2
//
//  Created by xs on 2019/4/9.
//  Copyright © 2019 Touker. All rights reserved.
//

#import "00image知识.h"
屏幕尺寸:   屏幕(英寸)  屏幕密度    分辨率(点数)  分辨率(像素)    显示模式
iphone4    3.5英寸    326ppi    320*480pt    640*960px     @2x
iphone5    4.0英寸    326ppi    320*568pt    640*1136px    @2x

iphone6/7/8     4.7英寸    326ppi    375*667pt    750*1334px     @2x
iphoneX         5.8英寸    458ppi    375*812pt    1125*2436px    @3x
iphoneXS        5.8英寸    458ppi    375*812pt    1125*2436px    @3x

iphone6/7/8+    5.5英寸    401ppi    414*736pt    1242*2208px    @3x
iphoneXR        6.1英寸    326ppi    414*896pt    828*1792px     @2x
iphoneXS Max    6.5英寸    458ppi    414*896pt    1242*2688px    @3x


英寸：1英寸 = 2.54厘米

像素:pixels或px
1.组成图像的单位，没有具体的大小

图片的分辨率:
1.72ppi:以像素每英寸ppi(pixels per inch)为单位来表示图像分辨率的大小，
2.640 X 480:每一个长度的方向上都有640个像素点;每一个宽度方向上都480个像素点;总数就是640X480=307200（个像素），简称30万像素

图片的尺寸:像素/英寸/点

图片的分辨率+图片的尺寸:图片制作

屏幕尺寸：屏幕对角线长度(X英寸)/1英寸 = Y英寸屏幕
屏幕分辨率:1280×720，就是屏幕的水平方向上有1280个像素点，垂直方向上有720个像素点


屏幕显示模式:
@1x:1个点等于1个像素 (1pt = 1px)
@2x:1个点等于2个像素 (1pt = 2px)
@3x:1个点等于3个像素 (1pt = 3px)


图片+屏幕+尺寸==》显示
